Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.141/PIC32CK-SG00/include/component/oscctrl.h
/*
 * Component description for OSCCTRL
 *
 * Copyright (c) 2023 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2023-04-05T13:26:46Z */
#ifndef _PIC32CKSG00_OSCCTRL_COMPONENT_H_
#define _PIC32CKSG00_OSCCTRL_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR OSCCTRL                                      */
/* ************************************************************************** */

/* -------- OSCCTRL_EVCTRL : (OSCCTRL Offset: 0x00) (R/W 32) Event Control -------- */
#define OSCCTRL_EVCTRL_RESETVALUE             _UINT32_(0x00)                                       /*  (OSCCTRL_EVCTRL) Event Control  Reset Value */

#define OSCCTRL_EVCTRL_CFDEO_Pos              _UINT32_(0)                                          /* (OSCCTRL_EVCTRL) Clock Failure Detector Event Output Enable Position */
#define OSCCTRL_EVCTRL_CFDEO_Msk              (_UINT32_(0x1) << OSCCTRL_EVCTRL_CFDEO_Pos)          /* (OSCCTRL_EVCTRL) Clock Failure Detector Event Output Enable Mask */
#define OSCCTRL_EVCTRL_CFDEO(value)           (OSCCTRL_EVCTRL_CFDEO_Msk & (_UINT32_(value) << OSCCTRL_EVCTRL_CFDEO_Pos)) /* Assigment of value for CFDEO in the OSCCTRL_EVCTRL register */
#define OSCCTRL_EVCTRL_Msk                    _UINT32_(0x00000001)                                 /* (OSCCTRL_EVCTRL) Register Mask  */


/* -------- OSCCTRL_INTENCLR : (OSCCTRL Offset: 0x04) (R/W 32) Interrupt Enable Clear -------- */
#define OSCCTRL_INTENCLR_RESETVALUE           _UINT32_(0x00)                                       /*  (OSCCTRL_INTENCLR) Interrupt Enable Clear  Reset Value */

#define OSCCTRL_INTENCLR_XOSCRDY_Pos          _UINT32_(0)                                          /* (OSCCTRL_INTENCLR) XOSC Ready Interrupt Enable Position */
#define OSCCTRL_INTENCLR_XOSCRDY_Msk          (_UINT32_(0x1) << OSCCTRL_INTENCLR_XOSCRDY_Pos)      /* (OSCCTRL_INTENCLR) XOSC Ready Interrupt Enable Mask */
#define OSCCTRL_INTENCLR_XOSCRDY(value)       (OSCCTRL_INTENCLR_XOSCRDY_Msk & (_UINT32_(value) << OSCCTRL_INTENCLR_XOSCRDY_Pos)) /* Assigment of value for XOSCRDY in the OSCCTRL_INTENCLR register */
#define OSCCTRL_INTENCLR_XOSCFAIL_Pos         _UINT32_(1)                                          /* (OSCCTRL_INTENCLR) XOSC Startup Failure Interrupt Enable Position */
#define OSCCTRL_INTENCLR_XOSCFAIL_Msk         (_UINT32_(0x1) << OSCCTRL_INTENCLR_XOSCFAIL_Pos)     /* (OSCCTRL_INTENCLR) XOSC Startup Failure Interrupt Enable Mask */
#define OSCCTRL_INTENCLR_XOSCFAIL(value)      (OSCCTRL_INTENCLR_XOSCFAIL_Msk & (_UINT32_(value) << OSCCTRL_INTENCLR_XOSCFAIL_Pos)) /* Assigment of value for XOSCFAIL in the OSCCTRL_INTENCLR register */
#define OSCCTRL_INTENCLR_CLKFAIL_Pos          _UINT32_(2)                                          /* (OSCCTRL_INTENCLR) XOSC Clock Failure Interrupt Enable Position */
#define OSCCTRL_INTENCLR_CLKFAIL_Msk          (_UINT32_(0x1) << OSCCTRL_INTENCLR_CLKFAIL_Pos)      /* (OSCCTRL_INTENCLR) XOSC Clock Failure Interrupt Enable Mask */
#define OSCCTRL_INTENCLR_CLKFAIL(value)       (OSCCTRL_INTENCLR_CLKFAIL_Msk & (_UINT32_(value) << OSCCTRL_INTENCLR_CLKFAIL_Pos)) /* Assigment of value for CLKFAIL in the OSCCTRL_INTENCLR register */
#define OSCCTRL_INTENCLR_DFLLRDY_Pos          _UINT32_(8)                                          /* (OSCCTRL_INTENCLR) DFLL Ready Interrupt Enable Position */
#define OSCCTRL_INTENCLR_DFLLRDY_Msk          (_UINT32_(0x1) << OSCCTRL_INTENCLR_DFLLRDY_Pos)      /* (OSCCTRL_INTENCLR) DFLL Ready Interrupt Enable Mask */
#define OSCCTRL_INTENCLR_DFLLRDY(value)       (OSCCTRL_INTENCLR_DFLLRDY_Msk & (_UINT32_(value) << OSCCTRL_INTENCLR_DFLLRDY_Pos)) /* Assigment of value for DFLLRDY in the OSCCTRL_INTENCLR register */
#define OSCCTRL_INTENCLR_DFLLLOCK_Pos         _UINT32_(9)                                          /* (OSCCTRL_INTENCLR) DFLL Lock Interrupt Enable Position */
#define OSCCTRL_INTENCLR_DFLLLOCK_Msk         (_UINT32_(0x1) << OSCCTRL_INTENCLR_DFLLLOCK_Pos)     /* (OSCCTRL_INTENCLR) DFLL Lock Interrupt Enable Mask */
#define OSCCTRL_INTENCLR_DFLLLOCK(value)      (OSCCTRL_INTENCLR_DFLLLOCK_Msk & (_UINT32_(value) << OSCCTRL_INTENCLR_DFLLLOCK_Pos)) /* Assigment of value for DFLLLOCK in the OSCCTRL_INTENCLR register */
#define OSCCTRL_INTENCLR_DFLLOVF_Pos          _UINT32_(10)                                         /* (OSCCTRL_INTENCLR) DFLL Tuner Overflow Interrupt Enable Position */
#define OSCCTRL_INTENCLR_DFLLOVF_Msk          (_UINT32_(0x1) << OSCCTRL_INTENCLR_DFLLOVF_Pos)      /* (OSCCTRL_INTENCLR) DFLL Tuner Overflow Interrupt Enable Mask */
#define OSCCTRL_INTENCLR_DFLLOVF(value)       (OSCCTRL_INTENCLR_DFLLOVF_Msk & (_UINT32_(value) << OSCCTRL_INTENCLR_DFLLOVF_Pos)) /* Assigment of value for DFLLOVF in the OSCCTRL_INTENCLR register */
#define OSCCTRL_INTENCLR_DFLLUNF_Pos          _UINT32_(11)                                         /* (OSCCTRL_INTENCLR) DFLL Tuner Underflow Interrupt Enable Position */
#define OSCCTRL_INTENCLR_DFLLUNF_Msk          (_UINT32_(0x1) << OSCCTRL_INTENCLR_DFLLUNF_Pos)      /* (OSCCTRL_INTENCLR) DFLL Tuner Underflow Interrupt Enable Mask */
#define OSCCTRL_INTENCLR_DFLLUNF(value)       (OSCCTRL_INTENCLR_DFLLUNF_Msk & (_UINT32_(value) << OSCCTRL_INTENCLR_DFLLUNF_Pos)) /* Assigment of value for DFLLUNF in the OSCCTRL_INTENCLR register */
#define OSCCTRL_INTENCLR_DFLLRCS_Pos          _UINT32_(12)                                         /* (OSCCTRL_INTENCLR) DFLL Reference Clock Stopped Interrupt Enable Position */
#define OSCCTRL_INTENCLR_DFLLRCS_Msk          (_UINT32_(0x1) << OSCCTRL_INTENCLR_DFLLRCS_Pos)      /* (OSCCTRL_INTENCLR) DFLL Reference Clock Stopped Interrupt Enable Mask */
#define OSCCTRL_INTENCLR_DFLLRCS(value)       (OSCCTRL_INTENCLR_DFLLRCS_Msk & (_UINT32_(value) << OSCCTRL_INTENCLR_DFLLRCS_Pos)) /* Assigment of value for DFLLRCS in the OSCCTRL_INTENCLR register */
#define OSCCTRL_INTENCLR_DFLLFAIL_Pos         _UINT32_(13)                                         /* (OSCCTRL_INTENCLR) DFLL Startup Failure Interrupt Enable Position */
#define OSCCTRL_INTENCLR_DFLLFAIL_Msk         (_UINT32_(0x1) << OSCCTRL_INTENCLR_DFLLFAIL_Pos)     /* (OSCCTRL_INTENCLR) DFLL Startup Failure Interrupt Enable Mask */
#define OSCCTRL_INTENCLR_DFLLFAIL(value)      (OSCCTRL_INTENCLR_DFLLFAIL_Msk & (_UINT32_(value) << OSCCTRL_INTENCLR_DFLLFAIL_Pos)) /* Assigment of value for DFLLFAIL in the OSCCTRL_INTENCLR register */
#define OSCCTRL_INTENCLR_PLL0LOCKR_Pos        _UINT32_(24)                                         /* (OSCCTRL_INTENCLR) PLL 0 Lock Rise Interrupt Enable Position */
#define OSCCTRL_INTENCLR_PLL0LOCKR_Msk        (_UINT32_(0x1) << OSCCTRL_INTENCLR_PLL0LOCKR_Pos)    /* (OSCCTRL_INTENCLR) PLL 0 Lock Rise Interrupt Enable Mask */
#define OSCCTRL_INTENCLR_PLL0LOCKR(value)     (OSCCTRL_INTENCLR_PLL0LOCKR_Msk & (_UINT32_(value) << OSCCTRL_INTENCLR_PLL0LOCKR_Pos)) /* Assigment of value for PLL0LOCKR in the OSCCTRL_INTENCLR register */
#define OSCCTRL_INTENCLR_PLL0LOCKF_Pos        _UINT32_(25)                                         /* (OSCCTRL_INTENCLR) PLL 0 Lock Fall Interrupt Enable Position */
#define OSCCTRL_INTENCLR_PLL0LOCKF_Msk        (_UINT32_(0x1) << OSCCTRL_INTENCLR_PLL0LOCKF_Pos)    /* (OSCCTRL_INTENCLR) PLL 0 Lock Fall Interrupt Enable Mask */
#define OSCCTRL_INTENCLR_PLL0LOCKF(value)     (OSCCTRL_INTENCLR_PLL0LOCKF_Msk & (_UINT32_(value) << OSCCTRL_INTENCLR_PLL0LOCKF_Pos)) /* Assigment of value for PLL0LOCKF in the OSCCTRL_INTENCLR register */
#define OSCCTRL_INTENCLR_Msk                  _UINT32_(0x03003F07)                                 /* (OSCCTRL_INTENCLR) Register Mask  */


/* -------- OSCCTRL_INTENSET : (OSCCTRL Offset: 0x08) (R/W 32) Interrupt Enable Set -------- */
#define OSCCTRL_INTENSET_RESETVALUE           _UINT32_(0x00)                                       /*  (OSCCTRL_INTENSET) Interrupt Enable Set  Reset Value */

