Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.141/PIC32CK-SG00/include/component/oscctrl.h
/* -------- OSCCTRL_PLL0FBDIV : (OSCCTRL Offset: 0x44) (R/W 32) PLL Feed-Back Divider -------- */
#define OSCCTRL_PLL0FBDIV_RESETVALUE          _UINT32_(0x00)                                       /*  (OSCCTRL_PLL0FBDIV) PLL Feed-Back Divider  Reset Value */

#define OSCCTRL_PLL0FBDIV_FBDIV_Pos           _UINT32_(0)                                          /* (OSCCTRL_PLL0FBDIV) PLL Feed-Back Divider Factor Position */
#define OSCCTRL_PLL0FBDIV_FBDIV_Msk           (_UINT32_(0x3FF) << OSCCTRL_PLL0FBDIV_FBDIV_Pos)     /* (OSCCTRL_PLL0FBDIV) PLL Feed-Back Divider Factor Mask */
#define OSCCTRL_PLL0FBDIV_FBDIV(value)        (OSCCTRL_PLL0FBDIV_FBDIV_Msk & (_UINT32_(value) << OSCCTRL_PLL0FBDIV_FBDIV_Pos)) /* Assigment of value for FBDIV in the OSCCTRL_PLL0FBDIV register */
#define OSCCTRL_PLL0FBDIV_Msk                 _UINT32_(0x000003FF)                                 /* (OSCCTRL_PLL0FBDIV) Register Mask  */


/* -------- OSCCTRL_PLL0REFDIV : (OSCCTRL Offset: 0x48) (R/W 32) PLL reference divider -------- */
#define OSCCTRL_PLL0REFDIV_RESETVALUE         _UINT32_(0x00)                                       /*  (OSCCTRL_PLL0REFDIV) PLL reference divider  Reset Value */

#define OSCCTRL_PLL0REFDIV_REFDIV_Pos         _UINT32_(0)                                          /* (OSCCTRL_PLL0REFDIV) PLL reference division factor Position */
#define OSCCTRL_PLL0REFDIV_REFDIV_Msk         (_UINT32_(0x3F) << OSCCTRL_PLL0REFDIV_REFDIV_Pos)    /* (OSCCTRL_PLL0REFDIV) PLL reference division factor Mask */
#define OSCCTRL_PLL0REFDIV_REFDIV(value)      (OSCCTRL_PLL0REFDIV_REFDIV_Msk & (_UINT32_(value) << OSCCTRL_PLL0REFDIV_REFDIV_Pos)) /* Assigment of value for REFDIV in the OSCCTRL_PLL0REFDIV register */
#define OSCCTRL_PLL0REFDIV_Msk                _UINT32_(0x0000003F)                                 /* (OSCCTRL_PLL0REFDIV) Register Mask  */


/* -------- OSCCTRL_PLL0POSTDIVA : (OSCCTRL Offset: 0x4C) (R/W 32) PLL output clock divider A -------- */
#define OSCCTRL_PLL0POSTDIVA_RESETVALUE       _UINT32_(0x20202020)                                 /*  (OSCCTRL_PLL0POSTDIVA) PLL output clock divider A  Reset Value */

#define OSCCTRL_PLL0POSTDIVA_POSTDIV0_Pos     _UINT32_(0)                                          /* (OSCCTRL_PLL0POSTDIVA) PLL output 0 clock division factor Position */
#define OSCCTRL_PLL0POSTDIVA_POSTDIV0_Msk     (_UINT32_(0x3F) << OSCCTRL_PLL0POSTDIVA_POSTDIV0_Pos) /* (OSCCTRL_PLL0POSTDIVA) PLL output 0 clock division factor Mask */
#define OSCCTRL_PLL0POSTDIVA_POSTDIV0(value)  (OSCCTRL_PLL0POSTDIVA_POSTDIV0_Msk & (_UINT32_(value) << OSCCTRL_PLL0POSTDIVA_POSTDIV0_Pos)) /* Assigment of value for POSTDIV0 in the OSCCTRL_PLL0POSTDIVA register */
#define OSCCTRL_PLL0POSTDIVA_OUTEN0_Pos       _UINT32_(7)                                          /* (OSCCTRL_PLL0POSTDIVA) PLL output 0 enable Position */
#define OSCCTRL_PLL0POSTDIVA_OUTEN0_Msk       (_UINT32_(0x1) << OSCCTRL_PLL0POSTDIVA_OUTEN0_Pos)   /* (OSCCTRL_PLL0POSTDIVA) PLL output 0 enable Mask */
#define OSCCTRL_PLL0POSTDIVA_OUTEN0(value)    (OSCCTRL_PLL0POSTDIVA_OUTEN0_Msk & (_UINT32_(value) << OSCCTRL_PLL0POSTDIVA_OUTEN0_Pos)) /* Assigment of value for OUTEN0 in the OSCCTRL_PLL0POSTDIVA register */
#define OSCCTRL_PLL0POSTDIVA_POSTDIV1_Pos     _UINT32_(8)                                          /* (OSCCTRL_PLL0POSTDIVA) PLL output 0 clock division factor Position */
#define OSCCTRL_PLL0POSTDIVA_POSTDIV1_Msk     (_UINT32_(0x3F) << OSCCTRL_PLL0POSTDIVA_POSTDIV1_Pos) /* (OSCCTRL_PLL0POSTDIVA) PLL output 0 clock division factor Mask */
#define OSCCTRL_PLL0POSTDIVA_POSTDIV1(value)  (OSCCTRL_PLL0POSTDIVA_POSTDIV1_Msk & (_UINT32_(value) << OSCCTRL_PLL0POSTDIVA_POSTDIV1_Pos)) /* Assigment of value for POSTDIV1 in the OSCCTRL_PLL0POSTDIVA register */
#define OSCCTRL_PLL0POSTDIVA_OUTEN1_Pos       _UINT32_(15)                                         /* (OSCCTRL_PLL0POSTDIVA) PLL output 0 enable Position */
#define OSCCTRL_PLL0POSTDIVA_OUTEN1_Msk       (_UINT32_(0x1) << OSCCTRL_PLL0POSTDIVA_OUTEN1_Pos)   /* (OSCCTRL_PLL0POSTDIVA) PLL output 0 enable Mask */
#define OSCCTRL_PLL0POSTDIVA_OUTEN1(value)    (OSCCTRL_PLL0POSTDIVA_OUTEN1_Msk & (_UINT32_(value) << OSCCTRL_PLL0POSTDIVA_OUTEN1_Pos)) /* Assigment of value for OUTEN1 in the OSCCTRL_PLL0POSTDIVA register */
#define OSCCTRL_PLL0POSTDIVA_POSTDIV2_Pos     _UINT32_(16)                                         /* (OSCCTRL_PLL0POSTDIVA) PLL output 0 clock division factor Position */
#define OSCCTRL_PLL0POSTDIVA_POSTDIV2_Msk     (_UINT32_(0x3F) << OSCCTRL_PLL0POSTDIVA_POSTDIV2_Pos) /* (OSCCTRL_PLL0POSTDIVA) PLL output 0 clock division factor Mask */
#define OSCCTRL_PLL0POSTDIVA_POSTDIV2(value)  (OSCCTRL_PLL0POSTDIVA_POSTDIV2_Msk & (_UINT32_(value) << OSCCTRL_PLL0POSTDIVA_POSTDIV2_Pos)) /* Assigment of value for POSTDIV2 in the OSCCTRL_PLL0POSTDIVA register */
#define OSCCTRL_PLL0POSTDIVA_OUTEN2_Pos       _UINT32_(23)                                         /* (OSCCTRL_PLL0POSTDIVA) PLL output 0 enable Position */
#define OSCCTRL_PLL0POSTDIVA_OUTEN2_Msk       (_UINT32_(0x1) << OSCCTRL_PLL0POSTDIVA_OUTEN2_Pos)   /* (OSCCTRL_PLL0POSTDIVA) PLL output 0 enable Mask */
#define OSCCTRL_PLL0POSTDIVA_OUTEN2(value)    (OSCCTRL_PLL0POSTDIVA_OUTEN2_Msk & (_UINT32_(value) << OSCCTRL_PLL0POSTDIVA_OUTEN2_Pos)) /* Assigment of value for OUTEN2 in the OSCCTRL_PLL0POSTDIVA register */
#define OSCCTRL_PLL0POSTDIVA_POSTDIV3_Pos     _UINT32_(24)                                         /* (OSCCTRL_PLL0POSTDIVA) PLL output 0 clock division factor Position */
#define OSCCTRL_PLL0POSTDIVA_POSTDIV3_Msk     (_UINT32_(0x3F) << OSCCTRL_PLL0POSTDIVA_POSTDIV3_Pos) /* (OSCCTRL_PLL0POSTDIVA) PLL output 0 clock division factor Mask */
#define OSCCTRL_PLL0POSTDIVA_POSTDIV3(value)  (OSCCTRL_PLL0POSTDIVA_POSTDIV3_Msk & (_UINT32_(value) << OSCCTRL_PLL0POSTDIVA_POSTDIV3_Pos)) /* Assigment of value for POSTDIV3 in the OSCCTRL_PLL0POSTDIVA register */
#define OSCCTRL_PLL0POSTDIVA_OUTEN3_Pos       _UINT32_(31)                                         /* (OSCCTRL_PLL0POSTDIVA) PLL output 0 enable Position */
#define OSCCTRL_PLL0POSTDIVA_OUTEN3_Msk       (_UINT32_(0x1) << OSCCTRL_PLL0POSTDIVA_OUTEN3_Pos)   /* (OSCCTRL_PLL0POSTDIVA) PLL output 0 enable Mask */
#define OSCCTRL_PLL0POSTDIVA_OUTEN3(value)    (OSCCTRL_PLL0POSTDIVA_OUTEN3_Msk & (_UINT32_(value) << OSCCTRL_PLL0POSTDIVA_OUTEN3_Pos)) /* Assigment of value for OUTEN3 in the OSCCTRL_PLL0POSTDIVA register */
#define OSCCTRL_PLL0POSTDIVA_Msk              _UINT32_(0xBFBFBFBF)                                 /* (OSCCTRL_PLL0POSTDIVA) Register Mask  */


/* -------- OSCCTRL_PLL0POSTDIVB : (OSCCTRL Offset: 0x50) (R/W 32) PLL output clock divider B -------- */
#define OSCCTRL_PLL0POSTDIVB_RESETVALUE       _UINT32_(0x2020)                                     /*  (OSCCTRL_PLL0POSTDIVB) PLL output clock divider B  Reset Value */

#define OSCCTRL_PLL0POSTDIVB_POSTDIV4_Pos     _UINT32_(0)                                          /* (OSCCTRL_PLL0POSTDIVB) PLL output 4 clock division factor Position */
#define OSCCTRL_PLL0POSTDIVB_POSTDIV4_Msk     (_UINT32_(0x3F) << OSCCTRL_PLL0POSTDIVB_POSTDIV4_Pos) /* (OSCCTRL_PLL0POSTDIVB) PLL output 4 clock division factor Mask */
#define OSCCTRL_PLL0POSTDIVB_POSTDIV4(value)  (OSCCTRL_PLL0POSTDIVB_POSTDIV4_Msk & (_UINT32_(value) << OSCCTRL_PLL0POSTDIVB_POSTDIV4_Pos)) /* Assigment of value for POSTDIV4 in the OSCCTRL_PLL0POSTDIVB register */
#define OSCCTRL_PLL0POSTDIVB_OUTEN4_Pos       _UINT32_(7)                                          /* (OSCCTRL_PLL0POSTDIVB) PLL output 4 enable Position */
#define OSCCTRL_PLL0POSTDIVB_OUTEN4_Msk       (_UINT32_(0x1) << OSCCTRL_PLL0POSTDIVB_OUTEN4_Pos)   /* (OSCCTRL_PLL0POSTDIVB) PLL output 4 enable Mask */
#define OSCCTRL_PLL0POSTDIVB_OUTEN4(value)    (OSCCTRL_PLL0POSTDIVB_OUTEN4_Msk & (_UINT32_(value) << OSCCTRL_PLL0POSTDIVB_OUTEN4_Pos)) /* Assigment of value for OUTEN4 in the OSCCTRL_PLL0POSTDIVB register */
#define OSCCTRL_PLL0POSTDIVB_POSTDIV5_Pos     _UINT32_(8)                                          /* (OSCCTRL_PLL0POSTDIVB) PLL output 4 clock division factor Position */
#define OSCCTRL_PLL0POSTDIVB_POSTDIV5_Msk     (_UINT32_(0x3F) << OSCCTRL_PLL0POSTDIVB_POSTDIV5_Pos) /* (OSCCTRL_PLL0POSTDIVB) PLL output 4 clock division factor Mask */
#define OSCCTRL_PLL0POSTDIVB_POSTDIV5(value)  (OSCCTRL_PLL0POSTDIVB_POSTDIV5_Msk & (_UINT32_(value) << OSCCTRL_PLL0POSTDIVB_POSTDIV5_Pos)) /* Assigment of value for POSTDIV5 in the OSCCTRL_PLL0POSTDIVB register */
#define OSCCTRL_PLL0POSTDIVB_OUTEN5_Pos       _UINT32_(15)                                         /* (OSCCTRL_PLL0POSTDIVB) PLL output 4 enable Position */
#define OSCCTRL_PLL0POSTDIVB_OUTEN5_Msk       (_UINT32_(0x1) << OSCCTRL_PLL0POSTDIVB_OUTEN5_Pos)   /* (OSCCTRL_PLL0POSTDIVB) PLL output 4 enable Mask */
#define OSCCTRL_PLL0POSTDIVB_OUTEN5(value)    (OSCCTRL_PLL0POSTDIVB_OUTEN5_Msk & (_UINT32_(value) << OSCCTRL_PLL0POSTDIVB_OUTEN5_Pos)) /* Assigment of value for OUTEN5 in the OSCCTRL_PLL0POSTDIVB register */
#define OSCCTRL_PLL0POSTDIVB_Msk              _UINT32_(0x0000BFBF)                                 /* (OSCCTRL_PLL0POSTDIVB) Register Mask  */


/* -------- OSCCTRL_FRACDIV0 : (OSCCTRL Offset: 0x6C) (R/W 32) Fractional Divider -------- */
#define OSCCTRL_FRACDIV0_RESETVALUE           _UINT32_(0x200000)                                   /*  (OSCCTRL_FRACDIV0) Fractional Divider  Reset Value */

#define OSCCTRL_FRACDIV0_REMDIV_Pos           _UINT32_(7)                                          /* (OSCCTRL_FRACDIV0) Frequency division factor reminder part Position */
#define OSCCTRL_FRACDIV0_REMDIV_Msk           (_UINT32_(0x1FF) << OSCCTRL_FRACDIV0_REMDIV_Pos)     /* (OSCCTRL_FRACDIV0) Frequency division factor reminder part Mask */
#define OSCCTRL_FRACDIV0_REMDIV(value)        (OSCCTRL_FRACDIV0_REMDIV_Msk & (_UINT32_(value) << OSCCTRL_FRACDIV0_REMDIV_Pos)) /* Assigment of value for REMDIV in the OSCCTRL_FRACDIV0 register */
#define OSCCTRL_FRACDIV0_INTDIV_Pos           _UINT32_(16)                                         /* (OSCCTRL_FRACDIV0) Frequency division factor integer part Position */
#define OSCCTRL_FRACDIV0_INTDIV_Msk           (_UINT32_(0x7FFF) << OSCCTRL_FRACDIV0_INTDIV_Pos)    /* (OSCCTRL_FRACDIV0) Frequency division factor integer part Mask */
#define OSCCTRL_FRACDIV0_INTDIV(value)        (OSCCTRL_FRACDIV0_INTDIV_Msk & (_UINT32_(value) << OSCCTRL_FRACDIV0_INTDIV_Pos)) /* Assigment of value for INTDIV in the OSCCTRL_FRACDIV0 register */
#define OSCCTRL_FRACDIV0_Msk                  _UINT32_(0x7FFFFF80)                                 /* (OSCCTRL_FRACDIV0) Register Mask  */


/* -------- OSCCTRL_SYNCBUSY : (OSCCTRL Offset: 0x78) ( R/ 32) Synchronization Busy -------- */
#define OSCCTRL_SYNCBUSY_RESETVALUE           _UINT32_(0x00)                                       /*  (OSCCTRL_SYNCBUSY) Synchronization Busy  Reset Value */

#define OSCCTRL_SYNCBUSY_DFLLENABLE_Pos       _UINT32_(1)                                          /* (OSCCTRL_SYNCBUSY) DFLL48M ENABLE Synchronization Busy Position */
#define OSCCTRL_SYNCBUSY_DFLLENABLE_Msk       (_UINT32_(0x1) << OSCCTRL_SYNCBUSY_DFLLENABLE_Pos)   /* (OSCCTRL_SYNCBUSY) DFLL48M ENABLE Synchronization Busy Mask */
#define OSCCTRL_SYNCBUSY_DFLLENABLE(value)    (OSCCTRL_SYNCBUSY_DFLLENABLE_Msk & (_UINT32_(value) << OSCCTRL_SYNCBUSY_DFLLENABLE_Pos)) /* Assigment of value for DFLLENABLE in the OSCCTRL_SYNCBUSY register */
#define OSCCTRL_SYNCBUSY_DFLLCTRLB_Pos        _UINT32_(2)                                          /* (OSCCTRL_SYNCBUSY) DFLLCTRLB Synchronization Busy Position */
#define OSCCTRL_SYNCBUSY_DFLLCTRLB_Msk        (_UINT32_(0x1) << OSCCTRL_SYNCBUSY_DFLLCTRLB_Pos)    /* (OSCCTRL_SYNCBUSY) DFLLCTRLB Synchronization Busy Mask */
#define OSCCTRL_SYNCBUSY_DFLLCTRLB(value)     (OSCCTRL_SYNCBUSY_DFLLCTRLB_Msk & (_UINT32_(value) << OSCCTRL_SYNCBUSY_DFLLCTRLB_Pos)) /* Assigment of value for DFLLCTRLB in the OSCCTRL_SYNCBUSY register */
#define OSCCTRL_SYNCBUSY_DFLLTUNE_Pos         _UINT32_(3)                                          /* (OSCCTRL_SYNCBUSY) DFLLTUNE Synchronization Busy Position */
#define OSCCTRL_SYNCBUSY_DFLLTUNE_Msk         (_UINT32_(0x1) << OSCCTRL_SYNCBUSY_DFLLTUNE_Pos)     /* (OSCCTRL_SYNCBUSY) DFLLTUNE Synchronization Busy Mask */
#define OSCCTRL_SYNCBUSY_DFLLTUNE(value)      (OSCCTRL_SYNCBUSY_DFLLTUNE_Msk & (_UINT32_(value) << OSCCTRL_SYNCBUSY_DFLLTUNE_Pos)) /* Assigment of value for DFLLTUNE in the OSCCTRL_SYNCBUSY register */
#define OSCCTRL_SYNCBUSY_DFLLDIFF_Pos         _UINT32_(4)                                          /* (OSCCTRL_SYNCBUSY) DFLLDIFF Synchronization Busy Position */
#define OSCCTRL_SYNCBUSY_DFLLDIFF_Msk         (_UINT32_(0x1) << OSCCTRL_SYNCBUSY_DFLLDIFF_Pos)     /* (OSCCTRL_SYNCBUSY) DFLLDIFF Synchronization Busy Mask */
#define OSCCTRL_SYNCBUSY_DFLLDIFF(value)      (OSCCTRL_SYNCBUSY_DFLLDIFF_Msk & (_UINT32_(value) << OSCCTRL_SYNCBUSY_DFLLDIFF_Pos)) /* Assigment of value for DFLLDIFF in the OSCCTRL_SYNCBUSY register */
#define OSCCTRL_SYNCBUSY_DFLLMUL_Pos          _UINT32_(5)                                          /* (OSCCTRL_SYNCBUSY) DFLLMUL Synchronization Busy Position */
#define OSCCTRL_SYNCBUSY_DFLLMUL_Msk          (_UINT32_(0x1) << OSCCTRL_SYNCBUSY_DFLLMUL_Pos)      /* (OSCCTRL_SYNCBUSY) DFLLMUL Synchronization Busy Mask */
#define OSCCTRL_SYNCBUSY_DFLLMUL(value)       (OSCCTRL_SYNCBUSY_DFLLMUL_Msk & (_UINT32_(value) << OSCCTRL_SYNCBUSY_DFLLMUL_Pos)) /* Assigment of value for DFLLMUL in the OSCCTRL_SYNCBUSY register */
#define OSCCTRL_SYNCBUSY_FRACDIV0_Pos         _UINT32_(6)                                          /* (OSCCTRL_SYNCBUSY) FRACDIV0 Synchronization Busy Position */
#define OSCCTRL_SYNCBUSY_FRACDIV0_Msk         (_UINT32_(0x1) << OSCCTRL_SYNCBUSY_FRACDIV0_Pos)     /* (OSCCTRL_SYNCBUSY) FRACDIV0 Synchronization Busy Mask */
#define OSCCTRL_SYNCBUSY_FRACDIV0(value)      (OSCCTRL_SYNCBUSY_FRACDIV0_Msk & (_UINT32_(value) << OSCCTRL_SYNCBUSY_FRACDIV0_Pos)) /* Assigment of value for FRACDIV0 in the OSCCTRL_SYNCBUSY register */
#define OSCCTRL_SYNCBUSY_FRACDIV1_Pos         _UINT32_(7)                                          /* (OSCCTRL_SYNCBUSY) FRACDIV1 Synchronization Busy Position */
#define OSCCTRL_SYNCBUSY_FRACDIV1_Msk         (_UINT32_(0x1) << OSCCTRL_SYNCBUSY_FRACDIV1_Pos)     /* (OSCCTRL_SYNCBUSY) FRACDIV1 Synchronization Busy Mask */
#define OSCCTRL_SYNCBUSY_FRACDIV1(value)      (OSCCTRL_SYNCBUSY_FRACDIV1_Msk & (_UINT32_(value) << OSCCTRL_SYNCBUSY_FRACDIV1_Pos)) /* Assigment of value for FRACDIV1 in the OSCCTRL_SYNCBUSY register */
#define OSCCTRL_SYNCBUSY_Msk                  _UINT32_(0x000000FE)                                 /* (OSCCTRL_SYNCBUSY) Register Mask  */

#define OSCCTRL_SYNCBUSY_FRACDIV_Pos          _UINT32_(6)                                          /* (OSCCTRL_SYNCBUSY Position) FRACDIVx Synchronization Busy */
#define OSCCTRL_SYNCBUSY_FRACDIV_Msk          (_UINT32_(0x3) << OSCCTRL_SYNCBUSY_FRACDIV_Pos)      /* (OSCCTRL_SYNCBUSY Mask) FRACDIV */
#define OSCCTRL_SYNCBUSY_FRACDIV(value)       (OSCCTRL_SYNCBUSY_FRACDIV_Msk & (_UINT32_(value) << OSCCTRL_SYNCBUSY_FRACDIV_Pos)) 

/* -------- OSCCTRL_XOSCCAL : (OSCCTRL Offset: 0x80) (R/W 32) XOSC Calibration Register -------- */
#define OSCCTRL_XOSCCAL_RESETVALUE            _UINT32_(0x00)                                       /*  (OSCCTRL_XOSCCAL) XOSC Calibration Register  Reset Value */

#define OSCCTRL_XOSCCAL_CAL_Pos               _UINT32_(0)                                          /* (OSCCTRL_XOSCCAL) XOSC Calibration Position */
#define OSCCTRL_XOSCCAL_CAL_Msk               (_UINT32_(0xFFFF) << OSCCTRL_XOSCCAL_CAL_Pos)        /* (OSCCTRL_XOSCCAL) XOSC Calibration Mask */
#define OSCCTRL_XOSCCAL_CAL(value)            (OSCCTRL_XOSCCAL_CAL_Msk & (_UINT32_(value) << OSCCTRL_XOSCCAL_CAL_Pos)) /* Assigment of value for CAL in the OSCCTRL_XOSCCAL register */
#define OSCCTRL_XOSCCAL_Msk                   _UINT32_(0x0000FFFF)                                 /* (OSCCTRL_XOSCCAL) Register Mask  */

/* FUSES_OSC_XTAL_HF_AGC_V2 mode */
#define OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_FTRANS_Pos _UINT32_(0)                                          /* (OSCCTRL_XOSCCAL) Fine Transconductance programmability for Oscillator Position */
#define OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_FTRANS_Msk (_UINT32_(0x3) << OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_FTRANS_Pos) /* (OSCCTRL_XOSCCAL) Fine Transconductance programmability for Oscillator Mask */
#define OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_FTRANS(value) (OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_FTRANS_Msk & (_UINT32_(value) << OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_FTRANS_Pos))
#define OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_KICKEREN_Pos _UINT32_(2)                                          /* (OSCCTRL_XOSCCAL) Kicker enable Position */
#define OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_KICKEREN_Msk (_UINT32_(0x1) << OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_KICKEREN_Pos) /* (OSCCTRL_XOSCCAL) Kicker enable Mask */
#define OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_KICKEREN(value) (OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_KICKEREN_Msk & (_UINT32_(value) << OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_KICKEREN_Pos))
#define OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_ENVAMP_Pos _UINT32_(3)                                          /* (OSCCTRL_XOSCCAL) envelope amplitude at osci Position */
#define OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_ENVAMP_Msk (_UINT32_(0x1) << OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_ENVAMP_Pos) /* (OSCCTRL_XOSCCAL) envelope amplitude at osci Mask */
#define OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_ENVAMP(value) (OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_ENVAMP_Msk & (_UINT32_(value) << OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_ENVAMP_Pos))
#define OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_HYST_Pos _UINT32_(4)                                          /* (OSCCTRL_XOSCCAL) loop hysteresis control Position */
#define OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_HYST_Msk (_UINT32_(0x1) << OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_HYST_Pos) /* (OSCCTRL_XOSCCAL) loop hysteresis control Mask */
#define OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_HYST(value) (OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_HYST_Msk & (_UINT32_(value) << OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_HYST_Pos))
#define OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_CMSEL_Pos _UINT32_(5)                                          /* (OSCCTRL_XOSCCAL) clock buffer common mode selection Position */
#define OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_CMSEL_Msk (_UINT32_(0x1) << OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_CMSEL_Pos) /* (OSCCTRL_XOSCCAL) clock buffer common mode selection Mask */
#define OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_CMSEL(value) (OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_CMSEL_Msk & (_UINT32_(value) << OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_CMSEL_Pos))
#define OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_FLIPPOL_Pos _UINT32_(6)                                          /* (OSCCTRL_XOSCCAL) flip output clock polarity Position */
#define OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_FLIPPOL_Msk (_UINT32_(0x1) << OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_FLIPPOL_Pos) /* (OSCCTRL_XOSCCAL) flip output clock polarity Mask */
#define OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_FLIPPOL(value) (OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_FLIPPOL_Msk & (_UINT32_(value) << OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_FLIPPOL_Pos))
#define OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_REDGAIN_Pos _UINT32_(8)                                          /* (OSCCTRL_XOSCCAL) reduce gain control timer Position */
#define OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_REDGAIN_Msk (_UINT32_(0x1) << OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_REDGAIN_Pos) /* (OSCCTRL_XOSCCAL) reduce gain control timer Mask */
#define OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_REDGAIN(value) (OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_REDGAIN_Msk & (_UINT32_(value) << OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_REDGAIN_Pos))
#define OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_REDOSC_Pos _UINT32_(9)                                          /* (OSCCTRL_XOSCCAL) reduce oscillation debug counter Position */
#define OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_REDOSC_Msk (_UINT32_(0x1) << OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_REDOSC_Pos) /* (OSCCTRL_XOSCCAL) reduce oscillation debug counter Mask */
#define OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_REDOSC(value) (OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_REDOSC_Msk & (_UINT32_(value) << OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_REDOSC_Pos))
#define OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_SPARES_Pos _UINT32_(10)                                         /* (OSCCTRL_XOSCCAL) Spare bits Position */
#define OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_SPARES_Msk (_UINT32_(0x3F) << OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_SPARES_Pos) /* (OSCCTRL_XOSCCAL) Spare bits Mask */
#define OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_SPARES(value) (OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_SPARES_Msk & (_UINT32_(value) << OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_SPARES_Pos))
#define OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2_Msk _UINT32_(0x0000FF7F)                                  /* (OSCCTRL_XOSCCAL_FUSES_OSC_XTAL_HF_AGC_V2) Register Mask  */


/* -------- OSCCTRL_RC48MCAL0 : (OSCCTRL Offset: 0x88) (R/W 32) RC48M Calibration 0 -------- */
#define OSCCTRL_RC48MCAL0_RESETVALUE          _UINT32_(0x00)                                       /*  (OSCCTRL_RC48MCAL0) RC48M Calibration 0  Reset Value */

